app/controllers/school_classes_controller.rb

	def create
		@school_class = SchoolClass.create(params.require(:school_class))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-05-21 20:37:40.544836"], ["updated_at", "2018-05-21 20:37:40.544836"]]

	def update
		@school_class.update(params.require(:school_class))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-05-21 20:37:40.876677"], ["id", 1]]

	def find_school_class
		@school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]