app/controllers/students_controller.rb

	def create
		@student = Student.create(params.require(:student))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-05-21 20:26:43.523164"], ["updated_at", "2018-05-21 20:26:43.523164"]]

	def update
		@student.update(params.require(:student))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-05-21 20:29:34.349876"], ["id", 1]]